Sakura-xgs/private_learning/02.Software/02.PDU01/02.src/PDU01_APP_RT1021/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1021xxxxx
package_id: MIMXRT1021DAG5A
mcu_data: ksdk2_0
processor_version: 24.12.10
board: MIMXRT1020-EVK
pin_labels:
- {pin_num: '14', pin_signal: GPIO_EMC_04, label: DI_K5, identifier: DI_K5}
- {pin_num: '18', pin_signal: GPIO_EMC_00, label: DI_K1, identifier: DI_K1}
- {pin_num: '17', pin_signal: GPIO_EMC_01, label: DI_K2, identifier: DI_K2}
- {pin_num: '16', pin_signal: GPIO_EMC_02, label: DI_K3, identifier: DI_K3}
- {pin_num: '15', pin_signal: GPIO_EMC_03, label: DI_K4, identifier: DI_K4}
- {pin_num: '13', pin_signal: GPIO_EMC_05, label: DI_K6, identifier: DI_K6}
- {pin_num: '12', pin_signal: GPIO_EMC_06, label: DI_K7, identifier: DI_K7}
- {pin_num: '10', pin_signal: GPIO_EMC_07, label: DI_K8, identifier: DI_K8}
- {pin_num: '9', pin_signal: GPIO_EMC_08, label: DI_K9, identifier: DI_K9}
- {pin_num: '8', pin_signal: GPIO_EMC_09, label: DI_K10, identifier: DI_K10}
- {pin_num: '7', pin_signal: GPIO_EMC_10, label: DI_K11, identifier: DI_K11}
- {pin_num: '4', pin_signal: GPIO_EMC_11, label: DI_K12, identifier: DI_K12}
- {pin_num: '3', pin_signal: GPIO_EMC_12, label: DI_K13, identifier: DI_K13}
- {pin_num: '2', pin_signal: GPIO_EMC_13, label: DI_K14, identifier: DI_K14}
- {pin_num: '1', pin_signal: GPIO_EMC_14, label: DI_K15, identifier: DI_K15}
- {pin_num: '143', pin_signal: GPIO_EMC_15, label: DI_K16, identifier: DI_K16}
- {pin_num: '142', pin_signal: GPIO_EMC_16, label: K8, identifier: SEMC_A0;K8}
- {pin_num: '141', pin_signal: GPIO_EMC_17, label: K7, identifier: SEMC_A1;K7}
- {pin_num: '138', pin_signal: GPIO_EMC_20, label: B6, identifier: B6}
- {pin_num: '137', pin_signal: GPIO_EMC_21, label: B5, identifier: B5}
- {pin_num: '136', pin_signal: GPIO_EMC_22, label: 'SEMC_A6/U14[31]/BT_CFG[4]', identifier: UART2_TX}
- {pin_num: '133', pin_signal: GPIO_EMC_23, label: 'SEMC_A7/U14[32]/BT_CFG[5]', identifier: UART2_RX}
- {pin_num: '132', pin_signal: GPIO_EMC_24, label: B4, identifier: B4}
- {pin_num: '131', pin_signal: GPIO_EMC_25, label: B3, identifier: B3}
- {pin_num: '130', pin_signal: GPIO_EMC_26, label: B2, identifier: B2}
- {pin_num: '129', pin_signal: GPIO_EMC_27, label: B1, identifier: B1}
- {pin_num: '128', pin_signal: GPIO_EMC_28, label: IO_ADD1, identifier: IO_ADD1}
- {pin_num: '127', pin_signal: GPIO_EMC_29, label: IO_ADD2, identifier: SEMC_CKE;IO_ADD2}
- {pin_num: '126', pin_signal: GPIO_EMC_30, label: IO_ADD3, identifier: SEMC_CLK;IO_ADD3}
- {pin_num: '125', pin_signal: GPIO_EMC_31, label: IO_ADD4, identifier: SEMC_DM1;IO_ADD4}
- {pin_num: '124', pin_signal: GPIO_EMC_32, label: VER_SEL_1, identifier: VER_SEL_1}
- {pin_num: '123', pin_signal: GPIO_EMC_33, label: VER_SEL_2, identifier: VER_SEL_2}
- {pin_num: '122', pin_signal: GPIO_EMC_34, label: 'SEMC_D10/U14[45]', identifier: WDI_PFO}
- {pin_num: '121', pin_signal: GPIO_EMC_35, label: DI_Hit, identifier: SEMC_D11;DI_Hit}
- {pin_num: '120', pin_signal: GPIO_EMC_36, label: DI_Water, identifier: SEMC_D12;DI_Water}
- {pin_num: '119', pin_signal: GPIO_EMC_37, label: DI_Door, identifier: SEMC_D13;DI_Door}
- {pin_num: '118', pin_signal: GPIO_EMC_38, label: 'SEMC_D14/U14[51]', identifier: UART5_TX}
- {pin_num: '117', pin_signal: GPIO_EMC_39, label: 'SEMC_D15/U14[53]', identifier: UART5_RX}
- {pin_num: '109', pin_signal: GPIO_AD_B0_02, label: GND, identifier: RS485_EN1}
- {pin_num: '108', pin_signal: GPIO_AD_B0_03, label: 'JTAG_TDI/J16[5]/WDOG_B', identifier: WDOG_B}
- {pin_num: '107', pin_signal: GPIO_AD_B0_04, label: 'JTAG_TDO/J16[13]/ENET_RST/U11[32]', identifier: ENET_RST;PHY_RST}
- {pin_num: '106', pin_signal: GPIO_AD_B0_05, label: USER_LED, identifier: RUN_LED}
- {pin_num: '100', pin_signal: GPIO_AD_B0_08, label: 'ENET_TX_CLK/U11[9]', identifier: ENET_TX_CLK;LED3}
- {pin_num: '99', pin_signal: GPIO_AD_B0_09, label: 'ENET_RXD1/U11[15]/J17[3]', identifier: ENET_RXD1;LED2}
- {pin_num: '98', pin_signal: GPIO_AD_B0_10, label: 'ENET_RXD0/U11[16]/J19[6]', identifier: ENET_RXD0;LED1}
- {pin_num: '96', pin_signal: GPIO_AD_B0_12, label: DCN_TEMP, identifier: DCN_TEMP}
- {pin_num: '95', pin_signal: GPIO_AD_B0_13, label: DCP_TEMP, identifier: DCP_TEMP}
- {pin_num: '94', pin_signal: GPIO_AD_B0_14, label: PCB_TEM2, identifier: PCB_TEM2}
- {pin_num: '93', pin_signal: GPIO_AD_B0_15, label: PCB_TEM1, identifier: PCB_TEM1}
- {pin_num: '92', pin_signal: GPIO_AD_B1_00, label: K16, identifier: K16}
- {pin_num: '91', pin_signal: GPIO_AD_B1_01, label: K15, identifier: K15}
- {pin_num: '90', pin_signal: GPIO_AD_B1_02, label: K14, identifier: K14}
- {pin_num: '89', pin_signal: GPIO_AD_B1_03, label: K13, identifier: K13}
- {pin_num: '88', pin_signal: GPIO_AD_B1_04, label: K12, identifier: K12}
- {pin_num: '87', pin_signal: GPIO_AD_B1_05, label: K11, identifier: K11}
- {pin_num: '84', pin_signal: GPIO_AD_B1_06, label: K10, identifier: K10}
- {pin_num: '83', pin_signal: GPIO_AD_B1_07, label: K9, identifier: K9}
- {pin_num: '80', pin_signal: GPIO_AD_B1_10, label: K6, identifier: K6}
- {pin_num: '79', pin_signal: GPIO_AD_B1_11, label: K5, identifier: K5}
- {pin_num: '78', pin_signal: GPIO_AD_B1_12, label: K4, identifier: K4}
- {pin_num: '76', pin_signal: GPIO_AD_B1_13, label: K3, identifier: K3}
- {pin_num: '75', pin_signal: GPIO_AD_B1_14, label: K2, identifier: K2}
- {pin_num: '74', pin_signal: GPIO_AD_B1_15, label: K1, identifier: K1}
- {pin_num: '48', pin_signal: GPIO_SD_B0_00, label: 'SD1_D2/J15[1]', identifier: IIC3_SCL}
- {pin_num: '47', pin_signal: GPIO_SD_B0_01, label: 'SD1_D3/J15[2]', identifier: IIC3_SDA}
- {pin_num: '46', pin_signal: GPIO_SD_B0_02, label: DI_GUN1_FB, identifier: SD1_CMD;DI_GUN1_FB}
- {pin_num: '45', pin_signal: GPIO_SD_B0_03, label: DI_GUN2_FB, identifier: SD1_CLK;DI_GUN2_FB}
- {pin_num: '43', pin_signal: GPIO_SD_B0_04, label: 'SD1_D0/J15[7]', identifier: UART7_TX}
- {pin_num: '42', pin_signal: GPIO_SD_B0_05, label: 'SD1_D1/J15[8]', identifier: UART7_RX}
- {pin_num: '41', pin_signal: GPIO_SD_B0_06, label: RS485_EN3, identifier: RS485_EN2}
- {pin_num: '30', pin_signal: GPIO_SD_B1_02, label: I2C4_SCL, identifier: UART8_TX}
- {pin_num: '26', pin_signal: GPIO_SD_B1_05, label: RS485_EN2, identifier: RS485_EN3}
- {pin_num: '27', pin_signal: GPIO_SD_B1_04, label: RS485_EN4, identifier: RS485_EN4}
- {pin_num: '28', pin_signal: GPIO_SD_B1_03, label: I2C4_SDA, identifier: UART8_RX}
- {pin_num: '81', pin_signal: GPIO_AD_B1_09, label: K7, identifier: K7}
- {pin_num: '82', pin_signal: GPIO_AD_B1_08, label: K8, identifier: K8}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

