Sakura-xgs/private_learning/02.Software/02.PDU01/02.src/PDU01_APP_RT1021/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '105', peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_06, pull_keeper_enable: Disable}
  - {pin_num: '101', peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_07, pull_keeper_enable: Disable}
  - {pin_num: '48', peripheral: LPI2C3, signal: SCL, pin_signal: GPIO_SD_B0_00, software_input_on: Enable, open_drain: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable,
    pull_up_down_config: Pull_Up_22K_Ohm}
  - {pin_num: '47', peripheral: LPI2C3, signal: SDA, pin_signal: GPIO_SD_B0_01, software_input_on: Enable, open_drain: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable,
    pull_up_down_config: Pull_Up_22K_Ohm}
  - {pin_num: '32', peripheral: CAN1, signal: RX, pin_signal: GPIO_SD_B1_01, pull_keeper_enable: Disable}
  - {pin_num: '33', peripheral: CAN1, signal: TX, pin_signal: GPIO_SD_B1_00, pull_keeper_enable: Disable}
  - {pin_num: '109', peripheral: GPIO1, signal: 'gpio_io, 02', pin_signal: GPIO_AD_B0_02, direction: OUTPUT, drive_strength: R0_6, pull_keeper_select: Pull, pull_keeper_enable: Disable,
    pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '122', peripheral: GPIO3, signal: 'gpio_io, 02', pin_signal: GPIO_EMC_34, direction: INPUT, open_drain: Disable, pull_keeper_select: Pull, pull_up_down_config: Pull_Up_47K_Ohm}
  - {pin_num: '18', peripheral: GPIO2, signal: 'gpio_io, 00', pin_signal: GPIO_EMC_00, direction: INPUT}
  - {pin_num: '17', peripheral: GPIO2, signal: 'gpio_io, 01', pin_signal: GPIO_EMC_01, direction: INPUT}
  - {pin_num: '108', peripheral: GPIO1, signal: 'gpio_io, 03', pin_signal: GPIO_AD_B0_03, direction: OUTPUT, pull_keeper_select: Keeper}
  - {pin_num: '1', peripheral: GPIO2, signal: 'gpio_io, 14', pin_signal: GPIO_EMC_14, direction: INPUT}
  - {pin_num: '2', peripheral: GPIO2, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_13, direction: INPUT}
  - {pin_num: '3', peripheral: GPIO2, signal: 'gpio_io, 12', pin_signal: GPIO_EMC_12, direction: INPUT}
  - {pin_num: '4', peripheral: GPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_EMC_11, direction: INPUT}
  - {pin_num: '143', peripheral: GPIO2, signal: 'gpio_io, 15', pin_signal: GPIO_EMC_15, direction: INPUT}
  - {pin_num: '7', peripheral: GPIO2, signal: 'gpio_io, 10', pin_signal: GPIO_EMC_10, direction: INPUT}
  - {pin_num: '8', peripheral: GPIO2, signal: 'gpio_io, 09', pin_signal: GPIO_EMC_09, direction: INPUT}
  - {pin_num: '9', peripheral: GPIO2, signal: 'gpio_io, 08', pin_signal: GPIO_EMC_08, direction: INPUT}
  - {pin_num: '10', peripheral: GPIO2, signal: 'gpio_io, 07', pin_signal: GPIO_EMC_07, direction: INPUT}
  - {pin_num: '12', peripheral: GPIO2, signal: 'gpio_io, 06', pin_signal: GPIO_EMC_06, direction: INPUT}
  - {pin_num: '13', peripheral: GPIO2, signal: 'gpio_io, 05', pin_signal: GPIO_EMC_05, direction: INPUT}
  - {pin_num: '14', peripheral: GPIO2, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_04, direction: INPUT}
  - {pin_num: '15', peripheral: GPIO2, signal: 'gpio_io, 03', pin_signal: GPIO_EMC_03, direction: INPUT}
  - {pin_num: '16', peripheral: GPIO2, signal: 'gpio_io, 02', pin_signal: GPIO_EMC_02, direction: INPUT}
  - {pin_num: '123', peripheral: GPIO3, signal: 'gpio_io, 01', pin_signal: GPIO_EMC_33, direction: INPUT}
  - {pin_num: '124', peripheral: GPIO3, signal: 'gpio_io, 00', pin_signal: GPIO_EMC_32, direction: INPUT}
  - {pin_num: '125', peripheral: GPIO2, signal: 'gpio_io, 31', pin_signal: GPIO_EMC_31, identifier: IO_ADD4, direction: INPUT}
  - {pin_num: '126', peripheral: GPIO2, signal: 'gpio_io, 30', pin_signal: GPIO_EMC_30, identifier: IO_ADD3, direction: INPUT}
  - {pin_num: '127', peripheral: GPIO2, signal: 'gpio_io, 29', pin_signal: GPIO_EMC_29, identifier: IO_ADD2, direction: INPUT}
  - {pin_num: '128', peripheral: GPIO2, signal: 'gpio_io, 28', pin_signal: GPIO_EMC_28, direction: INPUT}
  - {pin_num: '93', peripheral: ADC1, signal: 'IN, 2', pin_signal: GPIO_AD_B0_15}
  - {pin_num: '95', peripheral: ADC2, signal: 'IN, 0', pin_signal: GPIO_AD_B0_13}
  - {pin_num: '96', peripheral: ADC1, signal: 'IN, 0', pin_signal: GPIO_AD_B0_12}
  - {pin_num: '74', peripheral: GPIO1, signal: 'gpio_io, 31', pin_signal: GPIO_AD_B1_15, direction: OUTPUT}
  - {pin_num: '75', peripheral: GPIO1, signal: 'gpio_io, 30', pin_signal: GPIO_AD_B1_14, direction: OUTPUT}
  - {pin_num: '76', peripheral: GPIO1, signal: 'gpio_io, 29', pin_signal: GPIO_AD_B1_13, direction: OUTPUT}
  - {pin_num: '78', peripheral: GPIO1, signal: 'gpio_io, 28', pin_signal: GPIO_AD_B1_12, direction: OUTPUT}
  - {pin_num: '79', peripheral: GPIO1, signal: 'gpio_io, 27', pin_signal: GPIO_AD_B1_11, direction: OUTPUT}
  - {pin_num: '80', peripheral: GPIO1, signal: 'gpio_io, 26', pin_signal: GPIO_AD_B1_10, direction: OUTPUT}
  - {pin_num: '81', peripheral: GPIO1, signal: 'gpio_io, 25', pin_signal: GPIO_AD_B1_09, direction: OUTPUT}
  - {pin_num: '82', peripheral: GPIO1, signal: 'gpio_io, 24', pin_signal: GPIO_AD_B1_08, direction: OUTPUT}
  - {pin_num: '83', peripheral: GPIO1, signal: 'gpio_io, 23', pin_signal: GPIO_AD_B1_07, direction: OUTPUT}
  - {pin_num: '87', peripheral: GPIO1, signal: 'gpio_io, 21', pin_signal: GPIO_AD_B1_05, direction: OUTPUT}
  - {pin_num: '88', peripheral: GPIO1, signal: 'gpio_io, 20', pin_signal: GPIO_AD_B1_04, direction: OUTPUT}
  - {pin_num: '89', peripheral: GPIO1, signal: 'gpio_io, 19', pin_signal: GPIO_AD_B1_03, direction: OUTPUT}
  - {pin_num: '90', peripheral: GPIO1, signal: 'gpio_io, 18', pin_signal: GPIO_AD_B1_02, direction: OUTPUT}
  - {pin_num: '91', peripheral: GPIO1, signal: 'gpio_io, 17', pin_signal: GPIO_AD_B1_01, direction: OUTPUT}
  - {pin_num: '92', peripheral: GPIO1, signal: 'gpio_io, 16', pin_signal: GPIO_AD_B1_00, direction: OUTPUT}
  - {pin_num: '84', peripheral: GPIO1, signal: 'gpio_io, 22', pin_signal: GPIO_AD_B1_06, direction: OUTPUT}
  - {pin_num: '106', peripheral: GPIO1, signal: 'gpio_io, 05', pin_signal: GPIO_AD_B0_05, direction: OUTPUT}
  - {pin_num: '94', peripheral: ADC2, signal: 'IN, 1', pin_signal: GPIO_AD_B0_14}
  - {pin_num: '98', peripheral: GPIO1, signal: 'gpio_io, 10', pin_signal: GPIO_AD_B0_10, identifier: LED1, direction: OUTPUT}
  - {pin_num: '99', peripheral: GPIO1, signal: 'gpio_io, 09', pin_signal: GPIO_AD_B0_09, identifier: LED2, direction: OUTPUT}
  - {pin_num: '100', peripheral: GPIO1, signal: 'gpio_io, 08', pin_signal: GPIO_AD_B0_08, identifier: LED3, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

