Sakura-xgs/private_learning/02.Software/02.PDU01/02.src/PDU01_APP_RT1021/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  /* GPIO configuration of RS485_EN1 on GPIO_AD_B0_02 (pin 109) */
  gpio_pin_config_t RS485_EN1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_02 (pin 109) */
  GPIO_PinInit(GPIO1, 2U, &RS485_EN1_config);

  /* GPIO configuration of WDOG_B on GPIO_AD_B0_03 (pin 108) */
  gpio_pin_config_t WDOG_B_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_03 (pin 108) */
  GPIO_PinInit(GPIO1, 3U, &WDOG_B_config);

  /* GPIO configuration of RUN_LED on GPIO_AD_B0_05 (pin 106) */
  gpio_pin_config_t RUN_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_05 (pin 106) */
  GPIO_PinInit(GPIO1, 5U, &RUN_LED_config);

  /* GPIO configuration of LED3 on GPIO_AD_B0_08 (pin 100) */
  gpio_pin_config_t LED3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_08 (pin 100) */
  GPIO_PinInit(GPIO1, 8U, &LED3_config);

  /* GPIO configuration of LED2 on GPIO_AD_B0_09 (pin 99) */
  gpio_pin_config_t LED2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_09 (pin 99) */
  GPIO_PinInit(GPIO1, 9U, &LED2_config);

  /* GPIO configuration of LED1 on GPIO_AD_B0_10 (pin 98) */
  gpio_pin_config_t LED1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_10 (pin 98) */
  GPIO_PinInit(GPIO1, 10U, &LED1_config);

  /* GPIO configuration of K16 on GPIO_AD_B1_00 (pin 92) */
  gpio_pin_config_t K16_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_00 (pin 92) */
  GPIO_PinInit(GPIO1, 16U, &K16_config);

  /* GPIO configuration of K15 on GPIO_AD_B1_01 (pin 91) */
  gpio_pin_config_t K15_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_01 (pin 91) */
  GPIO_PinInit(GPIO1, 17U, &K15_config);

  /* GPIO configuration of K14 on GPIO_AD_B1_02 (pin 90) */
  gpio_pin_config_t K14_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_02 (pin 90) */
  GPIO_PinInit(GPIO1, 18U, &K14_config);

  /* GPIO configuration of K13 on GPIO_AD_B1_03 (pin 89) */
  gpio_pin_config_t K13_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_03 (pin 89) */
  GPIO_PinInit(GPIO1, 19U, &K13_config);

  /* GPIO configuration of K12 on GPIO_AD_B1_04 (pin 88) */
  gpio_pin_config_t K12_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_04 (pin 88) */
  GPIO_PinInit(GPIO1, 20U, &K12_config);

  /* GPIO configuration of K11 on GPIO_AD_B1_05 (pin 87) */
  gpio_pin_config_t K11_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_05 (pin 87) */
  GPIO_PinInit(GPIO1, 21U, &K11_config);

  /* GPIO configuration of K10 on GPIO_AD_B1_06 (pin 84) */
  gpio_pin_config_t K10_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_06 (pin 84) */
  GPIO_PinInit(GPIO1, 22U, &K10_config);

  /* GPIO configuration of K9 on GPIO_AD_B1_07 (pin 83) */
  gpio_pin_config_t K9_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_07 (pin 83) */
  GPIO_PinInit(GPIO1, 23U, &K9_config);

  /* GPIO configuration of K8 on GPIO_AD_B1_08 (pin 82) */
  gpio_pin_config_t K8_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_08 (pin 82) */
  GPIO_PinInit(GPIO1, 24U, &K8_config);

  /* GPIO configuration of K7 on GPIO_AD_B1_09 (pin 81) */
  gpio_pin_config_t K7_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_09 (pin 81) */
  GPIO_PinInit(GPIO1, 25U, &K7_config);

  /* GPIO configuration of K6 on GPIO_AD_B1_10 (pin 80) */
  gpio_pin_config_t K6_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_10 (pin 80) */
  GPIO_PinInit(GPIO1, 26U, &K6_config);

  /* GPIO configuration of K5 on GPIO_AD_B1_11 (pin 79) */
  gpio_pin_config_t K5_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_11 (pin 79) */
  GPIO_PinInit(GPIO1, 27U, &K5_config);

  /* GPIO configuration of K4 on GPIO_AD_B1_12 (pin 78) */
  gpio_pin_config_t K4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_12 (pin 78) */
  GPIO_PinInit(GPIO1, 28U, &K4_config);

  /* GPIO configuration of K3 on GPIO_AD_B1_13 (pin 76) */
  gpio_pin_config_t K3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_13 (pin 76) */
  GPIO_PinInit(GPIO1, 29U, &K3_config);

  /* GPIO configuration of K2 on GPIO_AD_B1_14 (pin 75) */
  gpio_pin_config_t K2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_14 (pin 75) */
  GPIO_PinInit(GPIO1, 30U, &K2_config);

  /* GPIO configuration of K1 on GPIO_AD_B1_15 (pin 74) */
  gpio_pin_config_t K1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_15 (pin 74) */
  GPIO_PinInit(GPIO1, 31U, &K1_config);

  /* GPIO configuration of DI_K1 on GPIO_EMC_00 (pin 18) */
  gpio_pin_config_t DI_K1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_00 (pin 18) */
  GPIO_PinInit(GPIO2, 0U, &DI_K1_config);

  /* GPIO configuration of DI_K2 on GPIO_EMC_01 (pin 17) */
  gpio_pin_config_t DI_K2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_01 (pin 17) */
  GPIO_PinInit(GPIO2, 1U, &DI_K2_config);

  /* GPIO configuration of DI_K3 on GPIO_EMC_02 (pin 16) */
  gpio_pin_config_t DI_K3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_02 (pin 16) */
  GPIO_PinInit(GPIO2, 2U, &DI_K3_config);

