Sakura-xgs/private_learning/02.Software/02.PDU01/02.src/PDU01_APP_RT1021/board/pin_mux.c
  /* GPIO configuration of DI_K4 on GPIO_EMC_03 (pin 15) */
  gpio_pin_config_t DI_K4_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_03 (pin 15) */
  GPIO_PinInit(GPIO2, 3U, &DI_K4_config);

  /* GPIO configuration of DI_K5 on GPIO_EMC_04 (pin 14) */
  gpio_pin_config_t DI_K5_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_04 (pin 14) */
  GPIO_PinInit(GPIO2, 4U, &DI_K5_config);

  /* GPIO configuration of DI_K6 on GPIO_EMC_05 (pin 13) */
  gpio_pin_config_t DI_K6_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_05 (pin 13) */
  GPIO_PinInit(GPIO2, 5U, &DI_K6_config);

  /* GPIO configuration of DI_K7 on GPIO_EMC_06 (pin 12) */
  gpio_pin_config_t DI_K7_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_06 (pin 12) */
  GPIO_PinInit(GPIO2, 6U, &DI_K7_config);

  /* GPIO configuration of DI_K8 on GPIO_EMC_07 (pin 10) */
  gpio_pin_config_t DI_K8_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_07 (pin 10) */
  GPIO_PinInit(GPIO2, 7U, &DI_K8_config);

  /* GPIO configuration of DI_K9 on GPIO_EMC_08 (pin 9) */
  gpio_pin_config_t DI_K9_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_08 (pin 9) */
  GPIO_PinInit(GPIO2, 8U, &DI_K9_config);

  /* GPIO configuration of DI_K10 on GPIO_EMC_09 (pin 8) */
  gpio_pin_config_t DI_K10_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_09 (pin 8) */
  GPIO_PinInit(GPIO2, 9U, &DI_K10_config);

  /* GPIO configuration of DI_K11 on GPIO_EMC_10 (pin 7) */
  gpio_pin_config_t DI_K11_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_10 (pin 7) */
  GPIO_PinInit(GPIO2, 10U, &DI_K11_config);

  /* GPIO configuration of DI_K12 on GPIO_EMC_11 (pin 4) */
  gpio_pin_config_t DI_K12_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_11 (pin 4) */
  GPIO_PinInit(GPIO2, 11U, &DI_K12_config);

  /* GPIO configuration of DI_K13 on GPIO_EMC_12 (pin 3) */
  gpio_pin_config_t DI_K13_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_12 (pin 3) */
  GPIO_PinInit(GPIO2, 12U, &DI_K13_config);

  /* GPIO configuration of DI_K14 on GPIO_EMC_13 (pin 2) */
  gpio_pin_config_t DI_K14_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_13 (pin 2) */
  GPIO_PinInit(GPIO2, 13U, &DI_K14_config);

  /* GPIO configuration of DI_K15 on GPIO_EMC_14 (pin 1) */
  gpio_pin_config_t DI_K15_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_14 (pin 1) */
  GPIO_PinInit(GPIO2, 14U, &DI_K15_config);

  /* GPIO configuration of DI_K16 on GPIO_EMC_15 (pin 143) */
  gpio_pin_config_t DI_K16_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_15 (pin 143) */
  GPIO_PinInit(GPIO2, 15U, &DI_K16_config);

  /* GPIO configuration of IO_ADD1 on GPIO_EMC_28 (pin 128) */
  gpio_pin_config_t IO_ADD1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_28 (pin 128) */
  GPIO_PinInit(GPIO2, 28U, &IO_ADD1_config);

  /* GPIO configuration of IO_ADD2 on GPIO_EMC_29 (pin 127) */
  gpio_pin_config_t IO_ADD2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_29 (pin 127) */
  GPIO_PinInit(GPIO2, 29U, &IO_ADD2_config);

  /* GPIO configuration of IO_ADD3 on GPIO_EMC_30 (pin 126) */
  gpio_pin_config_t IO_ADD3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_30 (pin 126) */
  GPIO_PinInit(GPIO2, 30U, &IO_ADD3_config);

  /* GPIO configuration of IO_ADD4 on GPIO_EMC_31 (pin 125) */
  gpio_pin_config_t IO_ADD4_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_31 (pin 125) */
  GPIO_PinInit(GPIO2, 31U, &IO_ADD4_config);

  /* GPIO configuration of VER_SEL_1 on GPIO_EMC_32 (pin 124) */
  gpio_pin_config_t VER_SEL_1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_32 (pin 124) */
  GPIO_PinInit(GPIO3, 0U, &VER_SEL_1_config);

  /* GPIO configuration of VER_SEL_2 on GPIO_EMC_33 (pin 123) */
  gpio_pin_config_t VER_SEL_2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_33 (pin 123) */
  GPIO_PinInit(GPIO3, 1U, &VER_SEL_2_config);

  /* GPIO configuration of WDI_PFO on GPIO_EMC_34 (pin 122) */
  gpio_pin_config_t WDI_PFO_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_34 (pin 122) */
  GPIO_PinInit(GPIO3, 2U, &WDI_PFO_config);

  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_05_GPIO1_IO05, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_08_GPIO1_IO08, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_09_GPIO1_IO09, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_10_GPIO1_IO10, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_12_GPIO1_IO12, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_13_GPIO1_IO13, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_14_GPIO1_IO14, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_15_GPIO1_IO15, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_GPIO1_IO16, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_GPIO1_IO17, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_02_GPIO1_IO18, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_09_GPIO1_IO25, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_13_GPIO1_IO29, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_14_GPIO1_IO30, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_15_GPIO1_IO31, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_00_GPIO2_IO00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_01_GPIO2_IO01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_02_GPIO2_IO02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_03_GPIO2_IO03, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_04_GPIO2_IO04, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_05_GPIO2_IO05, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_06_GPIO2_IO06, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_07_GPIO2_IO07, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_08_GPIO2_IO08, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_09_GPIO2_IO09, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_10_GPIO2_IO10, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_11_GPIO2_IO11, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_12_GPIO2_IO12, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_13_GPIO2_IO13, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_14_GPIO2_IO14, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_15_GPIO2_IO15, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_28_GPIO2_IO28, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_29_GPIO2_IO29, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_30_GPIO2_IO30, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_31_GPIO2_IO31, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_32_GPIO3_IO00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_33_GPIO3_IO01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_34_GPIO3_IO02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_00_LPI2C3_SCL, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_01_LPI2C3_SDA, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_FLEXCAN1_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_FLEXCAN1_RX, 0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 0x20B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0x50A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_34_GPIO3_IO02, 0x70B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_00_LPI2C3_SCL, 0xD8B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_01_LPI2C3_SDA, 0xD8B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_00_FLEXCAN1_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_01_FLEXCAN1_RX, 0xB0U); 
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
